org/dart_practice3_functional_language.org
:PROPERTIES:
:ID:       0B32C47A-6BDE-4C6B-93B2-9F63AB89CF2C
:mtime:    20230827171212 20230827160343 20230827145812 20230827132852 20230827122223 20230827111924 20230827101802 20230826191824 20230826181457 20230826164529 20230826154323
:ctime:    20230826154323
:END:
#+title: [dart] practice3 functional language
#+AUTHOR: holy
#+EMAIL: hoyoul.park@gmail.com
#+DATE: <2023-08-26 Sat>
#+DESCRIPTION: functional language
#+HUGO_DRAFT: true
* [1-type casting] List -> Map
- List를 Map으로 변환(asMap 사용)
- key는 0,1,2가 붙는다.
- Map은 {}로 표현된다.

#+BEGIN_SRC dart
  void main(){
    List<String> black = ['a','b','c'];
    print(black.asMap());
  }
#+END_SRC

#+RESULTS:
: {0: a, 1: b, 2: c}

* [2-type casting] List -> Set
- set으로 변환(toSet()사용)
- set도 {} 객체 형태다.
#+BEGIN_SRC dart
  void main(){
    List<String> bb = ['a','b','d','d'];

    print(bb.toSet());

  }
#+END_SRC

#+RESULTS:
: {a, b, d}

* [3-type casting] Map -> keys,values iterator -> list
- iterable을 toList()를 사용해서 list로 바꾼다.
#+BEGIN_SRC dart
  void main(){
    Map<int,String> black = {0:'a',1:'b',2:'c'};
    print('----------------------');
    print(black.keys.toList());
    print(black.values.toList());

  }
#+END_SRC

#+RESULTS:
: ----------------------
: [0, 1, 2]
: [a, b, c]

* [4-type casting] List -> Set
- list를 set으로 만들기 위해서, toSet()를 사용했다.
- Set의 static function인 from()을 사용해서 set으로 만들수도 있다.


#+BEGIN_SRC dart
  void main(){
    List<String> l1 = ['1','2','3'];
    Set s1 = Set.from(l1);
    print(s1);
  }
#+END_SRC

#+RESULTS:
: {1, 2, 3}

* [5- map function] map function 사용
- collection들에는 map function이 있다. map function에 lambda를
  기술해서 사용한다.
- map에서 lambda를 표현하는 방식은 두가지가 있다.
- (){} 방식은 return문이 있어야 하고, ()=> ,화살표 방식에선 return문이
  자동으로 일어난다.
- return되는 값은 iterable이다.
  
#+BEGIN_SRC dart
    void main(){
      List<String> li = ['a','b','c'];
      print(li.map((x){ return x + ' black'; }));  
  }
 
#+END_SRC

#+RESULTS:
: (a black, b black, c black)

* [6- map function] map() - arrow function
- arrow function을 사용해서 lambda를 만들수 있다.
- lambda의 결과는 iterable 객체가 return된다.
- return된 iterable을 toList() 사용해서 List로 바꿀수 있다. 

#+BEGIN_SRC dart
  void main(){
    List<String> li1 = ['a','b','c'];
    Iterable result = li1.map((x) => 'black' + x);
    print('===================');
    print(result.toList());
  }
#+END_SRC

#+RESULTS:
: ===================
: [blacka, blackb, blackc]

* [7- map function] string map 사용예
- string에는 map()이 없다. split()로 list를 만든다.
- string을 concat은 + 말고 embeded string을 사용할 수 있다. 
#+BEGIN_SRC dart
  void main(){
    String number = '13579';
    // final parsed = number.split('').map((x)=> x+'.jpg');
    final parsed = number.split('').map((x)=> '$x.jpg');    
    print(parsed);
  }

#+END_SRC

#+RESULTS:
: (1.jpg, 3.jpg, 5.jpg, 7.jpg, 9.jpg)
