org/dart_practice3_functional_language.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-27 Fri 12:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>[dart] practice3 functional language</title>
<meta name="author" content="holy" />
<meta name="description" content="functional language
Org-HTML export made simple." />
<meta name="keywords" content="org-mode, export, html, theme, style, css, js, bigblow" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">[dart] practice3 functional language</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcd92eee">1. [1-type casting] List -&gt; Map</a></li>
<li><a href="#org7a22c1a">2. [2-type casting] List -&gt; Set</a></li>
<li><a href="#orgd7d7b63">3. [3-type casting] Map -&gt; keys,values iterator -&gt; list</a></li>
<li><a href="#org39c1039">4. [4-type casting] List -&gt; Set</a></li>
<li><a href="#org8906189">5. [5- map function] map function 사용</a></li>
<li><a href="#orge1088a7">6. [6- map function] map() - arrow function</a></li>
<li><a href="#orgefb7de5">7. [7- map function] string map 사용예</a></li>
<li><a href="#org7823c5c">8. [8- map function] Map에서 map() 사용하기</a></li>
<li><a href="#orga7b1fda">9. [9- map function] Map을 list로 처리</a></li>
<li><a href="#orgefae55f">10. [10- map function] Set에서 map 을 사용해서 변경하기.</a></li>
<li><a href="#org0a9d82a">11. [11- where function] where function 사용법</a></li>
<li><a href="#org66f6aa2">12. [12- reduce function] List에서 reduce 출력</a></li>
<li><a href="#org0faa5e8">13. [13- reduce function] reduce로 단어를 문장으로 합치기</a></li>
<li><a href="#orgb041c74">14. [14- reduce function] reduce가 return하는 값의 type.</a></li>
<li><a href="#orgf484b45">15. [15- fold function] fold 사용법- reduce의 대안</a></li>
<li><a href="#org72e9b6f">16. [16- fold function] 일반적인 fold함수</a></li>
<li><a href="#org5594fa3">17. [17- cascading operator] 여러개의 list를 하나로 합칠때 사용한다.</a></li>
<li><a href="#orgd3ccf96">18. [18- functional programming] functional programming의 일반적인 사용예(json -&gt; class)</a></li>
<li><a href="#org75c6d2e">19. [19- functional programming] functional programming의 일반적인 사용예 (looping 하기)</a></li>
<li><a href="#org5de756c">20. [20- functional programming] functional programming의 일반적인 사용예 (where 사용법)</a></li>
<li><a href="#org5440dea">21. [20- functional programming] functional programming의 일반적인 사용예 (chain rule 사용)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcd92eee" class="outline-2">
<h2 id="orgcd92eee"><span class="section-number-2">1.</span> [1-type casting] List -&gt; Map</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>List를 Map으로 변환(asMap 사용)</li>
<li>key는 0,1,2가 붙는다.</li>
<li>Map은 {}로 표현된다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">black</span> = [<span style="color: #fce566;">'a'</span>,<span style="color: #fce566;">'b'</span>,<span style="color: #fce566;">'c'</span>];
  print(black.asMap());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7a22c1a" class="outline-2">
<h2 id="org7a22c1a"><span class="section-number-2">2.</span> [2-type casting] List -&gt; Set</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>set으로 변환(toSet()사용)</li>
<li>set도 {} 객체 형태다.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">bb</span> = [<span style="color: #fce566;">'a'</span>,<span style="color: #fce566;">'b'</span>,<span style="color: #fce566;">'d'</span>,<span style="color: #fce566;">'d'</span>];

  print(bb.toSet());

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7d7b63" class="outline-2">
<h2 id="orgd7d7b63"><span class="section-number-2">3.</span> [3-type casting] Map -&gt; keys,values iterator -&gt; list</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>iterable을 toList()를 사용해서 list로 바꾼다.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">int</span>,<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">black</span> = {<span style="color: #948ae3;">0</span>:<span style="color: #fce566;">'a'</span>,<span style="color: #948ae3;">1</span>:<span style="color: #fce566;">'b'</span>,<span style="color: #948ae3;">2</span>:<span style="color: #fce566;">'c'</span>};
  print(<span style="color: #fce566;">'----------------------'</span>);
  print(black.keys.toList());
  print(black.values.toList());

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org39c1039" class="outline-2">
<h2 id="org39c1039"><span class="section-number-2">4.</span> [4-type casting] List -&gt; Set</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>list를 set으로 만들기 위해서, toSet()를 사용했다.</li>
<li>Set의 static function인 from()을 사용해서 set으로 만들수도 있다.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">l1</span> = [<span style="color: #fce566;">'1'</span>,<span style="color: #fce566;">'2'</span>,<span style="color: #fce566;">'3'</span>];
  <span style="color: #5ad4e6;">Set</span> <span style="color: #f7f1ff;">s1</span> = <span style="color: #5ad4e6;">Set</span>.from(l1);
  print(s1);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8906189" class="outline-2">
<h2 id="org8906189"><span class="section-number-2">5.</span> [5- map function] map function 사용</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>collection들에는 map function이 있다. map function에 lambda를
기술해서 사용한다.</li>
<li>map에서 lambda를 표현하는 방식은 두가지가 있다.</li>
<li>(){} 방식은 return문이 있어야 하고, ()=&gt; ,화살표 방식에선 return문이
자동으로 일어난다.</li>
<li>return되는 값은 iterable이다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart">  <span style="color: #5ad4e6;">void</span> main(){
    <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">li</span> = [<span style="color: #fce566;">'a'</span>,<span style="color: #fce566;">'b'</span>,<span style="color: #fce566;">'c'</span>];
    print(li.map((x){ <span style="color: #5ad4e6;">return</span> x + <span style="color: #fce566;">' black'</span>; }));  
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orge1088a7" class="outline-2">
<h2 id="orge1088a7"><span class="section-number-2">6.</span> [6- map function] map() - arrow function</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>arrow function을 사용해서 lambda를 만들수 있다.</li>
<li>lambda의 결과는 iterable 객체가 return된다.</li>
<li>return된 iterable을 toList() 사용해서 List로 바꿀수 있다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">li1</span> = [<span style="color: #fce566;">'a'</span>,<span style="color: #fce566;">'b'</span>,<span style="color: #fce566;">'c'</span>];
  <span style="color: #5ad4e6;">Iterable</span> <span style="color: #f7f1ff;">result</span> = li1.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #fce566;">'black'</span> + x);
  print(<span style="color: #fce566;">'==================='</span>);
  print(result.toList());
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefb7de5" class="outline-2">
<h2 id="orgefb7de5"><span class="section-number-2">7.</span> [7- map function] string map 사용예</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>string에는 map()이 없다. split()로 list를 만든다.</li>
<li>string을 concat은 + 말고 embeded string을 사용할 수 있다.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">String</span> <span style="color: #f7f1ff;">number</span> = <span style="color: #fce566;">'13579'</span>;
  <span style="color: #69676c;">// </span><span style="color: #69676c;">final parsed = number.split('').map((x)=&gt; x+'.jpg');</span>
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">parsed</span> = number.split(<span style="color: #fce566;">''</span>).map((x)=&gt; <span style="color: #fce566;">'</span><span style="color: #f7f1ff;">$x</span><span style="color: #fce566;">.jpg'</span>);    
  print(parsed);
}

</pre>
</div>
</div>
</div>
