content/posts/dart_practice3_functional_language.md
+++
title = "[dart] practice3 functional language"
author = ["holy"]
description = "functional language"
date = 2023-08-26T00:00:00+09:00
draft = true
+++

## [1-type casting] List -&gt; Map {#1-type-casting-list-map}

-   List를 Map으로 변환(asMap 사용)
-   key는 0,1,2가 붙는다.
-   Map은 {}로 표현된다.

<!--listend-->

```dart
void main(){
  List<String> black = ['a','b','c'];
  print(black.asMap());
}
```


## [2-type casting] List -&gt; Set {#2-type-casting-list-set}

-   set으로 변환(toSet()사용)
-   set도 {} 객체 형태다.

<!--listend-->

```dart
void main(){
  List<String> bb = ['a','b','d','d'];

  print(bb.toSet());

}
```


## [3-type casting] Map -&gt; keys,values iterator -&gt; list {#3-type-casting-map-keys-values-iterator-list}

-   iterable을 toList()를 사용해서 list로 바꾼다.

<!--listend-->

```dart
void main(){
  Map<int,String> black = {0:'a',1:'b',2:'c'};
  print('----------------------');
  print(black.keys.toList());
  print(black.values.toList());

}
```


## [4-type casting] List -&gt; Set {#4-type-casting-list-set}

-   list를 set으로 만들기 위해서, toSet()를 사용했다.
-   Set의 static function인 from()을 사용해서 set으로 만들수도 있다.

<!--listend-->

```dart
void main(){
  List<String> l1 = ['1','2','3'];
  Set s1 = Set.from(l1);
  print(s1);
}
```


## [5- map function] map function 사용 {#5-map-function-map-function-사용}

-   collection들에는 map function이 있다. map function에 lambda를
    기술해서 사용한다.
-   map에서 lambda를 표현하는 방식은 두가지가 있다.
-   (){} 방식은 return문이 있어야 하고, ()=&gt; ,화살표 방식에선 return문이
    자동으로 일어난다.
-   return되는 값은 iterable이다.

<!--listend-->

```dart
  void main(){
    List<String> li = ['a','b','c'];
    print(li.map((x){ return x + ' black'; }));
}

```


## [6- map function] map() - arrow function {#6-map-function-map-arrow-function}

-   arrow function을 사용해서 lambda를 만들수 있다.
-   lambda의 결과는 iterable 객체가 return된다.
-   return된 iterable을 toList() 사용해서 List로 바꿀수 있다.

<!--listend-->

```dart
void main(){
  List<String> li1 = ['a','b','c'];
  Iterable result = li1.map((x) => 'black' + x);
  print('===================');
  print(result.toList());
}
```


## [7- map function] string map 사용예 {#7-map-function-string-map-사용예}

-   string에는 map()이 없다. split()로 list를 만든다.
-   string을 concat은 + 말고 embeded string을 사용할 수 있다.

<!--listend-->

```dart
void main(){
  String number = '13579';
  // final parsed = number.split('').map((x)=> x+'.jpg');
  final parsed = number.split('').map((x)=> '$x.jpg');
  print(parsed);
}

```
