org/dart_practice3_functional_language.org
* [8- map function] Map에서 map() 사용하기
- list에만 map()가 있는게 아니다.
- Map에도 map함수가 있다. map함수를 적용하면 return값은 Map이 나온다.
- key와 value를 모두 처리해야한다. lambda의 인자로 key, value가
  들어간다.
- body에서 MapEntry함수를 사용해서 Map으로 만든다. MapEntry함수는
  key값과 value값을 따로 처리한다.


#+BEGIN_SRC dart
  void main(){
    Map<String,String> map1 = {
      "1":"one","2":"two","3":"three",};
    final result = map1.map((x,y) => MapEntry('key1 $x', 'value1 $y'));
    print(result);

  }
#+END_SRC

#+RESULTS:
: {key1 1: value1 one, key1 2: value1 two, key1 3: value1 three}

* [9- map function] Map을 list로 처리
- Map을 map()를 사용해서 Map으로 바꾸는 경우는 많지 않다.
- Map의 key나 value를 iterable로 뽑아낸후 list로 변환해서 사용한다.
- iterable은 map()가 있다. map()로 iterable요소들에 대한 조작이 가능하다.

#+BEGIN_SRC dart

  void main(){
    Map<String,String> map1 = {
      '1':'one',
      '2':'two',
      '3':'three',
      };
    print('----------------');
    print(map1.keys.map((x) => 'number $x').toList());

  }

#+END_SRC

#+RESULTS:
: ----------------
: [number 1, number 2, number 3]

* [10- map function] Set에서 map 을 사용해서 변경하기.
- Set에도 map을 적용할 수 있다.
- Set에 map을 적용하면 iterable이 return된다. 여기서 toSet()로 다시
  Set으로 변환한다.

#+BEGIN_SRC dart
  void main(){
    Set dict1 = {
      '1',
      '2',
      '3',
    };

    final result = dict1.map((x) => 'number $x').toSet();
    print(result);

  }
#+END_SRC

#+RESULTS:
: {number 1, number 2, number 3}
* [11- where function] where function 사용법
- 보통 json처리할 때 많이 사용된다. filtering한다.
- List안에 map이 들어간 형태의 json을 만들자.
- where에서 사용되는 lambda가 조건문처럼 쓰인다. return값은
  iterable이다. 따라서 toList()로 list로 바꿔준다.

#+BEGIN_SRC dart
  void main(){
    List<Map<String,String>> people = [
      {
        'name':'holy',
        'group': 'logic',
      },
      {
        'name': 'frege',
        'group': 'math',
      },
      ];
      print('----------------');
      print(people);
      final result = people.where((x) => x['group'] == 'math');
      print(result);
  }
#+END_SRC

#+RESULTS:
: ----------------
: [{name: holy, group: logic}, {name: frege, group: math}]
: ({name: frege, group: math})

* [12- reduce function] List에서 reduce 출력
- reduce는 lisp에도 있다.
- map처럼 lambda함수를 사용한다. 그런데 lambda함수의 인자가 정해져
  있다.
- 동작원리는 prev에는 이전단계의 결과가 입력으로 들어간다.
  
#+BEGIN_SRC dart
  void main(){
    List<int> li1 = [1,2,3];
    final result = li1.reduce((prev,next) {
        print('==================');
        print('prev = $prev');
        print('next = $next');
        return prev + next;
    });

  }
#+END_SRC

#+RESULTS:
: ==================
: prev = 1
: next = 2
: ==================
: prev = 3
: next = 3

* [13- reduce function] reduce로 단어를 문장으로 합치기
- reduce는 iterable을 return하지 않는다. 값을 return한다.
- map은 iterable을 return한다.
#+BEGIN_SRC dart
  void main(){
    List<String> li1 = ['안녕','하세요','holy','입니다.'];
    final result = li1.reduce((prev,next) => prev + next);
    print(result);
  }
#+END_SRC

#+RESULTS:
: 안녕하세요holy입니다.

* [14- reduce function] reduce가 return하는 값의 type. 
- reduce가 iterable이 아닌 값을 return한다.
- return하는 값의 제약이 있다. List가 String원소라면 reduce결과값도
  String이여야 한다. int면 int여야 한다.
- 아래는 에러가 나는 예이다. String에서 int값을 return하는 reduce다.
#+BEGIN_SRC dart
  void main(){

    List<String> li1 = [
      "one",
      "two",
      "three",
      ];
    final result = li1.reduce((prev,next) => prev.length + next.length);
    print(result);

  }
#+END_SRC

#+RESULTS:


