org/dart_practice3_functional_language.html
<div id="outline-container-org7823c5c" class="outline-2">
<h2 id="org7823c5c"><span class="section-number-2">8.</span> [8- map function] Map에서 map() 사용하기</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>list에만 map()가 있는게 아니다.</li>
<li>Map에도 map함수가 있다. map함수를 적용하면 return값은 Map이 나온다.</li>
<li>key와 value를 모두 처리해야한다. lambda의 인자로 key, value가
들어간다.</li>
<li>body에서 MapEntry함수를 사용해서 Map으로 만든다. MapEntry함수는
key값과 value값을 따로 처리한다.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">map1</span> = {
    <span style="color: #fce566;">"1"</span>:<span style="color: #fce566;">"one"</span>,<span style="color: #fce566;">"2"</span>:<span style="color: #fce566;">"two"</span>,<span style="color: #fce566;">"3"</span>:<span style="color: #fce566;">"three"</span>,};
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = map1.map((<span style="color: #f7f1ff;">x</span>,<span style="color: #f7f1ff;">y</span>) =&gt; <span style="color: #5ad4e6;">MapEntry</span>(<span style="color: #fce566;">'key1 </span><span style="color: #f7f1ff;">$x</span><span style="color: #fce566;">'</span>, <span style="color: #fce566;">'value1 </span><span style="color: #f7f1ff;">$y</span><span style="color: #fce566;">'</span>));
  print(result);

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga7b1fda" class="outline-2">
<h2 id="orga7b1fda"><span class="section-number-2">9.</span> [9- map function] Map을 list로 처리</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>Map을 map()를 사용해서 Map으로 바꾸는 경우는 많지 않다.</li>
<li>Map의 key나 value를 iterable로 뽑아낸후 list로 변환해서 사용한다.</li>
<li>iterable은 map()가 있다. map()로 iterable요소들에 대한 조작이 가능하다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart">
<span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">map1</span> = {
    <span style="color: #fce566;">'1'</span>:<span style="color: #fce566;">'one'</span>,
    <span style="color: #fce566;">'2'</span>:<span style="color: #fce566;">'two'</span>,
    <span style="color: #fce566;">'3'</span>:<span style="color: #fce566;">'three'</span>,
    };
  print(<span style="color: #fce566;">'----------------'</span>);
  print(map1.keys.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #fce566;">'number </span><span style="color: #f7f1ff;">$x</span><span style="color: #fce566;">'</span>).toList());

}

</pre>
</div>
</div>
</div>

<div id="outline-container-orgefae55f" class="outline-2">
<h2 id="orgefae55f"><span class="section-number-2">10.</span> [10- map function] Set에서 map 을 사용해서 변경하기.</h2>
<div class="outline-text-2" id="text-10">
<ul class="org-ul">
<li>Set에도 map을 적용할 수 있다.</li>
<li>Set에 map을 적용하면 iterable이 return된다. 여기서 toSet()로 다시
Set으로 변환한다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">Set</span> <span style="color: #f7f1ff;">dict1</span> = {
    <span style="color: #fce566;">'1'</span>,
    <span style="color: #fce566;">'2'</span>,
    <span style="color: #fce566;">'3'</span>,
  };

  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = dict1.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #fce566;">'number </span><span style="color: #f7f1ff;">$x</span><span style="color: #fce566;">'</span>).toSet();
  print(result);

}
</pre>
</div>
</div>
</div>
<div id="outline-container-org0a9d82a" class="outline-2">
<h2 id="org0a9d82a"><span class="section-number-2">11.</span> [11- where function] where function 사용법</h2>
<div class="outline-text-2" id="text-11">
<ul class="org-ul">
<li>보통 json처리할 때 많이 사용된다. filtering한다.</li>
<li>List안에 map이 들어간 형태의 json을 만들자.</li>
<li>where에서 사용되는 lambda가 조건문처럼 쓰인다. return값은
iterable이다. 따라서 toList()로 list로 바꿔준다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt;&gt; <span style="color: #f7f1ff;">people</span> = [
    {
      <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'holy'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'logic'</span>,
    },
    {
      <span style="color: #fce566;">'name'</span>: <span style="color: #fce566;">'frege'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'math'</span>,
    },
    ];
    print(<span style="color: #fce566;">'----------------'</span>);
    print(people);
    <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = people.where((<span style="color: #f7f1ff;">x</span>) =&gt; x[<span style="color: #fce566;">'group'</span>] == <span style="color: #fce566;">'math'</span>);
    print(result);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org66f6aa2" class="outline-2">
<h2 id="org66f6aa2"><span class="section-number-2">12.</span> [12- reduce function] List에서 reduce 출력</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li>reduce는 lisp에도 있다.</li>
<li>map처럼 lambda함수를 사용한다. 그런데 lambda함수의 인자가 정해져
있다.</li>
<li>동작원리는 prev에는 이전단계의 결과가 입력으로 들어간다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">int</span>&gt; <span style="color: #f7f1ff;">li1</span> = [<span style="color: #948ae3;">1</span>,<span style="color: #948ae3;">2</span>,<span style="color: #948ae3;">3</span>];
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = li1.reduce((<span style="color: #f7f1ff;">prev</span>,<span style="color: #f7f1ff;">next</span>) {
      print(<span style="color: #fce566;">'=================='</span>);
      print(<span style="color: #fce566;">'prev = </span><span style="color: #f7f1ff;">$prev</span><span style="color: #fce566;">'</span>);
      print(<span style="color: #fce566;">'next = </span><span style="color: #f7f1ff;">$next</span><span style="color: #fce566;">'</span>);
      <span style="color: #5ad4e6;">return</span> prev + next;
  });

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0faa5e8" class="outline-2">
<h2 id="org0faa5e8"><span class="section-number-2">13.</span> [13- reduce function] reduce로 단어를 문장으로 합치기</h2>
<div class="outline-text-2" id="text-13">
<ul class="org-ul">
<li>reduce는 iterable을 return하지 않는다. 값을 return한다.</li>
<li>map은 iterable을 return한다.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">li1</span> = [<span style="color: #fce566;">'&#50504;&#45397;'</span>,<span style="color: #fce566;">'&#54616;&#49464;&#50836;'</span>,<span style="color: #fce566;">'holy'</span>,<span style="color: #fce566;">'&#51077;&#45768;&#45796;.'</span>];
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = li1.reduce((<span style="color: #f7f1ff;">prev</span>,<span style="color: #f7f1ff;">next</span>) =&gt; prev + next);
  print(result);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb041c74" class="outline-2">
<h2 id="orgb041c74"><span class="section-number-2">14.</span> [14- reduce function] reduce가 return하는 값의 type.</h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>reduce가 iterable이 아닌 값을 return한다.</li>
<li>return하는 값의 제약이 있다. List가 String원소라면 reduce결과값도
String이여야 한다. int면 int여야 한다.</li>
<li>아래는 에러가 나는 예이다. String에서 int값을 return하는 reduce다.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){

  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">li1</span> = [
    <span style="color: #fce566;">"one"</span>,
    <span style="color: #fce566;">"two"</span>,
    <span style="color: #fce566;">"three"</span>,
    ];
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = li1.reduce((<span style="color: #f7f1ff;">prev</span>,<span style="color: #f7f1ff;">next</span>) =&gt; prev.length + next.length);
  print(result);

}
</pre>
</div>
</div>
</div>
