org/dart_practice3_functional_language.html


<div id="outline-container-orgf484b45" class="outline-2">
<h2 id="orgf484b45"><span class="section-number-2">15.</span> [15- fold function] fold 사용법- reduce의 대안</h2>
<div class="outline-text-2" id="text-15">
<ul class="org-ul">
<li>reduce의 문제는 list의 원소 type과 다른 reduce type이 나오면 안된다.</li>
<li>fold는 다른 type을 return해도 상관없다.</li>
<li>reduce와 다른건 시작값이 있다는 것과, return 하는 type을 generic으로
명시한다는 것이다.</li>
<li>위에서 reduce로 안된걸 fold로 해보자.</li>
<li>여기서 주의할께, lambda의 인자가 모두 int라고 생각해야 한다.</li>
<li>초기값 0과 next.length의 합은 int고 이것은 다시 prev입력으로 들어간다.</li>
</ul>

<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">String</span>&gt; <span style="color: #f7f1ff;">li1</span> = [ <span style="color: #fce566;">'abc'</span>, <span style="color: #fce566;">'d'</span>,<span style="color: #fce566;">'ef'</span>];

  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = li1.fold&lt;<span style="color: #5ad4e6;">int</span>&gt;(<span style="color: #948ae3;">0</span>,(<span style="color: #f7f1ff;">prev</span>,<span style="color: #f7f1ff;">next</span>) =&gt; prev + next.length);
  print(result);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org72e9b6f" class="outline-2">
<h2 id="org72e9b6f"><span class="section-number-2">16.</span> [16- fold function] 일반적인 fold함수</h2>
<div class="outline-text-2" id="text-16">
<ul class="org-ul">
<li>sum을 구하는 fold함수를 만들어보자.</li>
</ul>
<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">int</span>&gt; <span style="color: #f7f1ff;">numbers</span> = [<span style="color: #948ae3;">1</span>,<span style="color: #948ae3;">2</span>,<span style="color: #948ae3;">3</span>,<span style="color: #948ae3;">4</span>,<span style="color: #948ae3;">5</span>];
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">sum</span> = numbers.fold&lt;<span style="color: #5ad4e6;">int</span>&gt;(<span style="color: #948ae3;">0</span>,(<span style="color: #f7f1ff;">prev</span>, <span style="color: #f7f1ff;">next</span>) =&gt; prev + next);
  print(sum);
  }
</pre>
</div>
</div>
</div>
<div id="outline-container-org5594fa3" class="outline-2">
<h2 id="org5594fa3"><span class="section-number-2">17.</span> [17- cascading operator] 여러개의 list를 하나로 합칠때 사용한다.</h2>
<div class="outline-text-2" id="text-17">
<ul class="org-ul">
<li>even과 odd list를 만들고 합치자.</li>
<li>even list와 odd list를 합칠때, 일반적인 방법의 문제점.</li>
<li>list안에 list가 있다.</li>
<li>list앞에 &#x2026;을 붙인다. unpacking과 비슷하다.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">int</span>&gt; <span style="color: #f7f1ff;">even</span> = [<span style="color: #948ae3;">2</span>,<span style="color: #948ae3;">4</span>,<span style="color: #948ae3;">6</span>,<span style="color: #948ae3;">8</span>,<span style="color: #948ae3;">10</span>];
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">int</span>&gt; <span style="color: #f7f1ff;">odd</span> = [<span style="color: #948ae3;">1</span>,<span style="color: #948ae3;">3</span>,<span style="color: #948ae3;">5</span>,<span style="color: #948ae3;">7</span>,<span style="color: #948ae3;">9</span>];

  print(<span style="color: #fce566;">'---------------'</span>);
  print([even,odd]);
  print([...even,...odd]);    

}
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd3ccf96" class="outline-2">
<h2 id="orgd3ccf96"><span class="section-number-2">18.</span> [18- functional programming] functional programming의 일반적인 사용예(json -&gt; class)</h2>
<div class="outline-text-2" id="text-18">
<ul class="org-ul">
<li>people이라는 json을 만든다.</li>
<li>person이라는  class를 만든다.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart">  <span style="color: #5ad4e6;">void</span> main(){
    <span style="color: #5ad4e6;">final</span> <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt;&gt; <span style="color: #f7f1ff;">people</span> = [
      {
        <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'holy'</span>,
        <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'cs'</span>,
      },
      {
        <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'frege'</span>,
        <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'math'</span>,
      },
      {
        <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'john'</span>,
        <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'math'</span>,
      },        
    ];

    print(<span style="color: #fce566;">'--------------------'</span>);
    print(people);

    <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">parsedPeople</span> = people.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #5ad4e6;">Person</span>(name:x[<span style="color: #fce566;">'name'</span>]!,group:x[<span style="color: #fce566;">'group'</span>]!)).toList();
      print(parsedPeople);
}
  <span style="color: #5ad4e6;">class</span> <span style="color: #5ad4e6;">Person</span>{
    <span style="color: #5ad4e6;">final</span> <span style="color: #5ad4e6;">String</span> <span style="color: #f7f1ff;">name</span>;
    <span style="color: #5ad4e6;">final</span> <span style="color: #5ad4e6;">String</span> <span style="color: #f7f1ff;">group</span>;
    <span style="color: #5ad4e6;">Person</span>({
        <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.name,
        <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.group,});
    <span style="color: #948ae3;">@override</span>
    <span style="color: #5ad4e6;">String</span> toString(){
      <span style="color: #5ad4e6;">return</span> <span style="color: #fce566;">'name :</span><span style="color: #f7f1ff;">$name</span><span style="color: #fce566;">, group:  </span><span style="color: #f7f1ff;">$group</span><span style="color: #fce566;">'</span>;
    }
}

</pre>
</div>
</div>
</div>

<div id="outline-container-org75c6d2e" class="outline-2">
<h2 id="org75c6d2e"><span class="section-number-2">19.</span> [19- functional programming] functional programming의 일반적인 사용예 (looping 하기)</h2>
<div class="outline-text-2" id="text-19">
<ul class="org-ul">
<li>json을 class로 만든후 for looping을 사용할 수 있다.</li>
<li>for-loop 사용할때 괄호로 묶는걸 잊지말자.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">class</span> <span style="color: #5ad4e6;">Person</span>{
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">name</span>;
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">group</span>;

  <span style="color: #5ad4e6;">Person</span>({
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.name,
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.group,
      });
  <span style="color: #948ae3;">@override</span>
  <span style="color: #5ad4e6;">String</span> toString(){
    <span style="color: #5ad4e6;">return</span> <span style="color: #fce566;">'name:</span><span style="color: #f7f1ff;">$name</span><span style="color: #fce566;">, group:</span><span style="color: #f7f1ff;">$group</span><span style="color: #fce566;">'</span>;
  }
}
<span style="color: #5ad4e6;">void</span> main(){

  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt;&gt; <span style="color: #f7f1ff;">people</span> = [
    {
      <span style="color: #fce566;">"name"</span>: <span style="color: #fce566;">"holy"</span>,
      <span style="color: #fce566;">"group"</span>: <span style="color: #fce566;">"cs"</span>,
    },
    {
      <span style="color: #fce566;">"name"</span>: <span style="color: #fce566;">"frege"</span>,
      <span style="color: #fce566;">"group"</span>: <span style="color: #fce566;">"math"</span>,
    },
    {
      <span style="color: #fce566;">"name"</span>: <span style="color: #fce566;">"john"</span>,
      <span style="color: #fce566;">"group"</span>: <span style="color: #fce566;">"math"</span>,
    },      
  ];

  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">results</span> = people.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #5ad4e6;">Person</span>(name:x[<span style="color: #fce566;">'name'</span>], group: x[<span style="color: #fce566;">'group'</span>])).toList();

  <span style="color: #5ad4e6;">for</span> (<span style="color: #5ad4e6;">Person</span> <span style="color: #f7f1ff;">person</span> <span style="color: #5ad4e6;">in</span> results){
    print(person);
  }
}

</pre>
</div>
</div>
</div>
