content/posts/dart_practice3_functional_language.md


## [15- fold function] fold 사용법- reduce의 대안 {#15-fold-function-fold-사용법-reduce의-대안}

-   reduce의 문제는 list의 원소 type과 다른 reduce type이 나오면 안된다.
-   fold는 다른 type을 return해도 상관없다.
-   reduce와 다른건 시작값이 있다는 것과, return 하는 type을 generic으로
    명시한다는 것이다.
-   위에서 reduce로 안된걸 fold로 해보자.
-   여기서 주의할께, lambda의 인자가 모두 int라고 생각해야 한다.
-   초기값 0과 next.length의 합은 int고 이것은 다시 prev입력으로 들어간다.

<!--listend-->

```dart
void main(){
  List<String> li1 = [ 'abc', 'd','ef'];

  final result = li1.fold<int>(0,(prev,next) => prev + next.length);
  print(result);
}
```


## [16- fold function] 일반적인 fold함수 {#16-fold-function-일반적인-fold함수}

-   sum을 구하는 fold함수를 만들어보자.

<!--listend-->

```dart
void main(){
  List<int> numbers = [1,2,3,4,5];
  final sum = numbers.fold<int>(0,(prev, next) => prev + next);
  print(sum);
  }
```


## [17- cascading operator] 여러개의 list를 하나로 합칠때 사용한다. {#17-cascading-operator-여러개의-list를-하나로-합칠때-사용한다-dot}

-   even과 odd list를 만들고 합치자.
-   even list와 odd list를 합칠때, 일반적인 방법의 문제점.
-   list안에 list가 있다.
-   list앞에 ...을 붙인다. unpacking과 비슷하다.

<!--listend-->

```dart
void main(){
  List<int> even = [2,4,6,8,10];
  List<int> odd = [1,3,5,7,9];

  print('---------------');
  print([even,odd]);
  print([...even,...odd]);

}
```


## [18- functional programming] functional programming의 일반적인 사용예(json -&gt; class) {#18-functional-programming-functional-programming의-일반적인-사용예--json-class}

-   people이라는 json을 만든다.
-   person이라는  class를 만든다.

<!--listend-->

```dart
  void main(){
    final List<Map<String,String>> people = [
      {
        'name':'holy',
        'group': 'cs',
      },
      {
        'name':'frege',
        'group': 'math',
      },
      {
        'name':'john',
        'group': 'math',
      },
    ];

    print('--------------------');
    print(people);

    final parsedPeople = people.map((x) => Person(name:x['name']!,group:x['group']!)).toList();
      print(parsedPeople);
}
  class Person{
    final String name;
    final String group;
    Person({
        required this.name,
        required this.group,});
    @override
    String toString(){
      return 'name :$name, group:  $group';
    }
}

```


## [19- functional programming] functional programming의 일반적인 사용예 (looping 하기) {#19-functional-programming-functional-programming의-일반적인-사용예--looping-하기}

-   json을 class로 만든후 for looping을 사용할 수 있다.
-   for-loop 사용할때 괄호로 묶는걸 잊지말자.

<!--listend-->

```dart
class Person{
  final name;
  final group;

  Person({
      required this.name,
      required this.group,
      });
  @override
  String toString(){
    return 'name:$name, group:$group';
  }
}
void main(){

  List<Map<String,String>> people = [
    {
      "name": "holy",
      "group": "cs",
    },
    {
      "name": "frege",
      "group": "math",
    },
    {
      "name": "john",
      "group": "math",
    },
  ];

  final results = people.map((x) => Person(name:x['name'], group: x['group'])).toList();

  for (Person person in results){
    print(person);
  }
}

```
