org/dart_practice3_functional_language.html
<div id="outline-container-org5de756c" class="outline-2">
<h2 id="org5de756c"><span class="section-number-2">20.</span> [20- functional programming] functional programming의 일반적인 사용예 (where 사용법)</h2>
<div class="outline-text-2" id="text-20">
<ul class="org-ul">
<li>객체 list를 가져온 후 group이 math인것만 출력해보자.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">class</span> <span style="color: #5ad4e6;">Person</span>{
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">name</span>;
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">group</span>;

  <span style="color: #5ad4e6;">Person</span>({
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.name,
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.group,
  });

  <span style="color: #948ae3;">@override</span>
  <span style="color: #5ad4e6;">String</span> toString(){
    <span style="color: #5ad4e6;">return</span> <span style="color: #fce566;">'name: </span><span style="color: #f7f1ff;">$name</span><span style="color: #fce566;">, group:</span><span style="color: #f7f1ff;">$group</span><span style="color: #fce566;">'</span>;
  }
}

<span style="color: #5ad4e6;">void</span> main(){
  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>,<span style="color: #5ad4e6;">String</span>&gt;&gt; <span style="color: #f7f1ff;">people</span> = [
    {
      <span style="color: #fce566;">'name'</span>: <span style="color: #fce566;">'holy'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'cs'</span>
    },
    {
      <span style="color: #fce566;">'name'</span>: <span style="color: #fce566;">'frege'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'cs'</span>
    },
    {
      <span style="color: #fce566;">'name'</span>: <span style="color: #fce566;">'john'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'math'</span>
    },
  ];

  <span style="color: #5ad4e6;">List</span> <span style="color: #f7f1ff;">parsedPeople</span> = people.map((<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #5ad4e6;">Person</span>(name:x[<span style="color: #fce566;">'name'</span>],group:x[<span style="color: #fce566;">'group'</span>])).toList();
  <span style="color: #5ad4e6;">for</span> (<span style="color: #5ad4e6;">Person</span> <span style="color: #f7f1ff;">p</span> <span style="color: #5ad4e6;">in</span> parsedPeople){
    print(p);
  }
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = parsedPeople.where((<span style="color: #f7f1ff;">x</span>) =&gt; x.group ==<span style="color: #fce566;">'math'</span>);
  print(result);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5440dea" class="outline-2">
<h2 id="org5440dea"><span class="section-number-2">21.</span> [20- functional programming] functional programming의 일반적인 사용예 (chain rule 사용)</h2>
<div class="outline-text-2" id="text-21">
<ul class="org-ul">
<li>people이라는 json을 map을 사용해서 객체 list로 만들었다. 만들어진
객체 list로 부터 where을 사용해서 filtering을 했는데, 이것을
연결해서 사용할 수 있다.</li>
</ul>


<div class="org-src-container">
<pre class="src src-dart"><span style="color: #5ad4e6;">class</span> <span style="color: #5ad4e6;">Person</span>{
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">name</span>;
  <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">group</span>;

  <span style="color: #5ad4e6;">Person</span>({
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.name,
      <span style="color: #948ae3;">required</span> <span style="color: #5ad4e6;">this</span>.group,
  });
  <span style="color: #948ae3;">@override</span>
  <span style="color: #5ad4e6;">String</span> toString(){
    <span style="color: #5ad4e6;">return</span> <span style="color: #fce566;">'name: </span><span style="color: #f7f1ff;">$name</span><span style="color: #fce566;">, group:</span><span style="color: #f7f1ff;">$group</span><span style="color: #fce566;">'</span>;
  }
}
<span style="color: #5ad4e6;">void</span> main(){

  <span style="color: #5ad4e6;">List</span>&lt;<span style="color: #5ad4e6;">Map</span>&lt;<span style="color: #5ad4e6;">String</span>, <span style="color: #5ad4e6;">String</span>&gt;&gt; <span style="color: #f7f1ff;">people</span> = [
    {
      <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'holy'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'cs'</span>,
    },
    {
      <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'frege'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'cs'</span>,
    },
    {
      <span style="color: #fce566;">'name'</span>:<span style="color: #fce566;">'john'</span>,
      <span style="color: #fce566;">'group'</span>: <span style="color: #fce566;">'math'</span>,
    },
    ];

    <span style="color: #5ad4e6;">final</span> <span style="color: #f7f1ff;">result</span> = people
    .map(
      (<span style="color: #f7f1ff;">x</span>) =&gt; <span style="color: #5ad4e6;">Person</span>(
        name:x[<span style="color: #fce566;">'name'</span>],
        group:x[<span style="color: #fce566;">'group'</span>]
      ),
    ).where((<span style="color: #f7f1ff;">x</span>) =&gt; x.group == <span style="color: #fce566;">'math'</span>);
    print(result);
}
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-10-20 Fri 00:00</p>
<p class="author">Author: holy</p>
<p class="date">Created: 2023-10-27 Fri 12:01</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>