content/posts/dart_practice3_functional_language.md


## [20- functional programming] functional programming의 일반적인 사용예 (where 사용법) {#20-functional-programming-functional-programming의-일반적인-사용예--where-사용법}

-   객체 list를 가져온 후 group이 math인것만 출력해보자.

<!--listend-->

```dart
class Person{
  final name;
  final group;

  Person({
      required this.name,
      required this.group,
  });

  @override
  String toString(){
    return 'name: $name, group:$group';
  }
}

void main(){
  List<Map<String,String>> people = [
    {
      'name': 'holy',
      'group': 'cs'
    },
    {
      'name': 'frege',
      'group': 'cs'
    },
    {
      'name': 'john',
      'group': 'math'
    },
  ];

  List parsedPeople = people.map((x) => Person(name:x['name'],group:x['group'])).toList();
  for (Person p in parsedPeople){
    print(p);
  }
  final result = parsedPeople.where((x) => x.group =='math');
  print(result);
}
```


## [20- functional programming] functional programming의 일반적인 사용예 (chain rule 사용) {#20-functional-programming-functional-programming의-일반적인-사용예--chain-rule-사용}

-   people이라는 json을 map을 사용해서 객체 list로 만들었다. 만들어진
    객체 list로 부터 where을 사용해서 filtering을 했는데, 이것을
    연결해서 사용할 수 있다.

<!--listend-->

```dart
class Person{
  final name;
  final group;

  Person({
      required this.name,
      required this.group,
  });
  @override
  String toString(){
    return 'name: $name, group:$group';
  }
}
void main(){

  List<Map<String, String>> people = [
    {
      'name':'holy',
      'group': 'cs',
    },
    {
      'name':'frege',
      'group': 'cs',
    },
    {
      'name':'john',
      'group': 'math',
    },
    ];

    final result = people
    .map(
      (x) => Person(
        name:x['name'],
        group:x['group']
      ),
    ).where((x) => x.group == 'math');
    print(result);
}
```
